[{"UID":"zhong2020rtfm","abstract":"Obtaining policies that can generalise to new environments in reinforcement learning is challenging. In this work, we demonstrate that language understanding via a reading policy learner is a promising vehicle for generalisation to new environments. We propose a grounded policy learning problem, Read to Fight Monsters (RTFM), in which the agent must jointly reason over a language goal, relevant dynamics described in a document, and environment observations. We procedurally generate environment dynamics and corresponding language descriptions of the dynamics, such that agents must read to understand new environment dynamics instead of memorising any particular information. In addition, we propose txt2π, a model that captures three-way interactions between the goal, document, and observations. On RTFM, txt2π generalises to new environments with dynamics not seen during training via reading. Furthermore, our model outperforms baselines such as FiLM and language-conditioned CNNs on RTFM. Through curriculum learning, txt2π produces policies that excel on complex RTFM tasks requiring several reasoning and coreference steps.","authors":"Victor Zhong|Tim Rocktäschel|Edward Grefenstette","im":"","keywords":"nlp|reading comprehension|reasoning|reinforcement learning","proceedings":"ICLR","title":"RTFM: Generalising to New Environment Dynamics via Reading","type":"Conference","year":"2020"},{"UID":"raileanu2020ride","abstract":"Exploration in sparse reward environments remains one of the key challenges of model-free reinforcement learning. Instead of solely relying on extrinsic rewards provided by the environment, many state-of-the-art methods use intrinsic rewards to encourage exploration. However, we show that existing methods fall short in procedurally-generated environments where an agent is unlikely to visit a state more than once. We propose a novel type of intrinsic reward which encourages the agent to take actions that lead to significant changes in its learned state representation. We evaluate our method on multiple challenging procedurally-generated tasks in MiniGrid, as well as on tasks with high-dimensional observations used in prior work. Our experiments demonstrate that this approach is more sample efficient than existing exploration methods, particularly for procedurally-generated MiniGrid environments. Furthermore, we analyze the learned behavior as well as the intrinsic reward received by our agent. In contrast to previous approaches, our intrinsic reward does not diminish during the course of training and it rewards the agent substantially more for interacting with objects that it can control.","authors":"Roberta Raileanu|Tim Rocktäschel","im":"","keywords":"curiosity|reinforcement learning","proceedings":"ICLR","title":"RIDE: Rewarding Impact-Driven Exploration for Procedurally-Generated Environments","type":"Conference","year":"2020"},{"UID":"kuettler2020nethack","abstract":"Progress in Reinforcement Learning (RL) algorithms goes hand-in-hand with the development of challenging environments that test the limits of current methods. While existing RL environments are either sufficiently complex or based on fast simulation, they are rarely both. Here, we present the NetHack Learning Environment (NLE), a scalable, procedurally generated, stochastic, rich, and challenging environment for RL research based on the popular single-player terminal-based roguelike game, NetHack. We argue that NetHack is sufficiently complex to drive long-term research on problems such as exploration, planning, skill acquisition, and language-conditioned RL, while dramatically reducing the computational resources required to gather a large amount of experience. We compare NLE and its task suite to existing alternatives, and discuss why it is an ideal medium for testing the robustness and systematic generalization of RL agents. We demonstrate empirical success for early stages of the game using a distributed Deep RL baseline and Random Network Distillation exploration, alongside qualitative analysis of various agents trained in the environment. NLE is open source at https://github.com/facebookresearch/nle.","authors":"Heinrich Küttler|Nantas Nardelli|Alexander H. Miller|Roberta Raileanu|Marco Selvatici|Edward Grefenstette|Tim Rocktäschel","im":"https://raw.githubusercontent.com/facebookresearch/nle/master/dat/nle/logo.png","keywords":"environment","proceedings":"BeTR-RL","title":"The NetHack Learning Environment","type":"Workshop","year":"2020"}]
